app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["content", "test"], ["created_at", "2022-03-06 07:49:54.687882"], ["updated_at", "2022-03-06 07:49:54.687882"]]
---
  def create
    @message = current_user.messages.create!(message_params)